app/controllers/bus_stops_controller.rb

  def index
    @bus_stops = BusStop.all
---
SELECT * FROM `bus_stops`

  def show
    @bus_stop = BusStop.find(:first, :select => "name, ref_code", :conditions => ["ref_code = ?",params[:id]])
    @date = Time.now.localtime.strftime("%Y-%m-%d")
    if params[:service]
      #@ind_services = Service.find(:all, :include => :journey_details, :conditions => ["services.term_start < ? AND (services.term_end > ? OR services.term_end IS NULL) AND journey_details.monday = '1'",@date,@date], :group => 'services.number')
      @services = Service.find(:all, :include => :journey_details, :conditions => ["trim(services.number) = ? AND services.term_start < ? AND (services.term_end > ? OR services.term_end IS NULL) AND journey_details.monday = '1'",params[:service],@date,@date])
      @times = JourneyStop.find(:all, :conditions => ["bus_stop_id = ? AND service_id IN(?)",params[:id],@services])
---
SELECT * FROM `bus_stops` WHERE (`bus_stops`.`ref_code` = '1800SB04961') LIMIT 1
SELECT * FROM `journey_details` WHERE (`journey_details`.`id` = 5389)
SELECT * FROM `services` WHERE (`services`.`id` IN (534,535,536,537,538,543,544,545,546,547,548,549,550,551,560,561,562,563,588,590,592,593,594,595,600,601,602,603,3120,3121,3122,3123,3386,3387,3388,3389,3394,3395,3396,3397))
SELECT * FROM `journey_stops` WHERE (bus_stop_id = '1800WEBS001 ' AND service_id IN(4482,4484)) ORDER BY departure, arrival