app/controllers/services_controller.rb

SELECT * FROM `services` WHERE (`services`.`id` = 530)
---
  def show
    @service = Service.find(params[:id])